insert into people(first_name, last_name, birth_date, phone_number, email) values
('Мар`ян', 'Місюрко', '2006-05-31', '380950733514', 'marianboy31@gmail.com'),
('Влад', 'Гілль', '2006-12-30', '380996253251', 'vladgilm@gmail.com'),
('Рома', 'Волощин', '2006-12-8', '380950123188', 'romavoloshyn@gmail.com'),
('Олександр', 'Ковальчук', '1995-03-15', '380671234567', 'o.kovalchuk@gmail.com'),
('Марія', 'Бондар', '2001-07-22', '380509876543', 'mariya.bondar@gmail.com'),
('Андрій', 'Ткаченко', '1988-11-30', '380631112233', 'tkachenko.andriy@gmail.com'),
('Олена', 'Левченко', '2004-05-12', '380974445566', 'levchenko.olena@gmail.com'),
('Дмитро', 'Павленко', '1992-01-25', '380997778899', 'pavlenko.dm@gmail.com'),
('Юлія', 'Шевченко', '1998-09-08', '380936667788', 'shevchenko.yulia@gmail.com'),
('Ігор', 'Мельник', '2005-12-20', '380682223344', 'imelnyk@gmail.com');


insert into patient(gender, type_client, people_id) values
('чоловік', 'пацієнт', 1),
('жінка', 'VIP', 5),
('чоловік', default, 6),
('чоловік', 'корпоративний клієнт', 7),
('жінка', 'пацієнт', 8),
('чоловік', 'страховий пацієнт', 9),
('жінка', 'страховий пацієнт', 10),
('чоловік', 'VIP', 11),
('жінка', 'корпоративний клієнт', 12),
('чоловік', 'пацієнт', 13);

insert into doctor(staff_type, specialization, people_id) values
('направник', 'Уролог', 1),
('асистент', 'Акушер-гінеколог', 5),
('направник', 'Мамолог', 6),
('спеціаліст', 'Ортопед-травматолог', 7),
('асистент', 'Гематолог', 8),
('спеціаліст', 'Гінеколог', 9),
('спеціаліст', 'Пульмонолог',10),
('асистент', 'Терапевт', 11),
('направник', 'Дерматолог', 12);

--Це для того, що лікар не міг сам собі робити прийом)
CREATE OR REPLACE FUNCTION check_doctor_is_not_patient()
RETURNS TRIGGER AS $$
BEGIN
    IF (SELECT people_id FROM patient WHERE patient_id = NEW.patient_id) = 
       (SELECT people_id FROM doctor WHERE doctor_id = NEW.doctor_id) THEN
        RAISE EXCEPTION 'Помилка: Лікар не може призначити прийом самому собі!';
    END IF;
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

CREATE TRIGGER trg_prevent_self_treatment
BEFORE INSERT OR UPDATE ON appointment
FOR EACH ROW EXECUTE FUNCTION check_doctor_is_not_patient();

INSERT INTO appointment (date_time, patient_id, doctor_id) VALUES
-- Пацієнт 3 (Мар'ян) -> Лікар 20 (Дерматолог Юлія)
('2024-05-16 10:00:00', 3, 20), 

-- Пацієнт 23 (Юлія) -> Лікар 1 (Уролог Мар'ян)
('2024-05-16 11:30:00', 23, 1), 

-- Пацієнт 24 (Ігор) -> Лікар 15 (Ортопед Олександр)
('2024-05-16 14:00:00', 24, 15), 

-- Пацієнт 20 (Андрій) -> Лікар 13 (Акушер Влад)
('2024-05-17 09:00:00', 20, 13), 

Пацієнт 4 (Влад) -> Лікар 19 (Терапевт Дмитро)
('2024-05-17 10:30:00', 4, 19), 

-- Пацієнт 22 (Дмитро) -> Лікар 17 (Гінеколог Андрій)
('2024-05-18 12:00:00', 22, 17);

insert into service(category, title, price, duration) values
('Гастроентерологія', 'Консультація гастроентеролога', '950.00', '60'),
('Алергологія', 'Алергологічна проба методом прік-тесту Грястиця збірна', '180.00', '30'),
('Вакцинації', 'Вакцинація Shingrix/Шингрікс проти оперізуючого герпесу (GSK, Belgium) з консультацією лікаря', '35960.00', '15'),
('Фізіотерапевтичні послуги', 'Фонофорез без урахування медикаментів (1 сеанс)', '590.00', '60'),
('Масаж', 'Антицелюлітний масаж (60 хв)', '1200.00', '60'),
('Проктологія', 'Ректороманоскопія', '950.00', '60'),
('Ревматологія', 'Повторна консультація ревматолога', '1400.00', '30'),
('Мамологія', 'Компрес молочної залози', '610.00', '30'),
('Дерматологія', 'Діагностика шкірних покривів "лампою ВУДА', '390.00', '20'),
('Чек-ап', 'Кардіологічний чек-ап: Здорове серце', '7395.00', '60');

insert into appointment_details(appointment_id, service_id) values
	(24, 1),
	(25, 8),
	(26, 9),
	(27, 10),
	(28, 11),
	(29, 12),
	(30, 13),
	(31, 14),
	(32, 15),
	(33, 16);
