INSERT INTO specialty (title) VALUES 
('Уролог'), ('Акушер-гінеколог'), ('Мамолог'), 
('Ортопед-травматолог'), ('Гематолог'), ('Гінеколог'), 
('Пульмонолог'), ('Терапевт'), ('Дерматолог');

INSERT INTO service_category_dict (name) VALUES 
('Гастроентерологія'), ('Алергологія'), ('Вакцинації'), 
('Фізіотерапевтичні послуги'), ('Масаж'), ('Проктологія'), 
('Ревматологія'), ('Мамологія'), ('Дерматологія'), ('Чек-ап');

INSERT INTO people (first_name, last_name, birth_date, phone_number, email) VALUES
('Мар`ян', 'Місюрко', '2006-05-31', '380950733514', 'marianboy31@gmail.com'),
('Влад', 'Гілль', '2006-12-30', '380996253251', 'vladgilm@gmail.com'),
('Рома', 'Волощин', '2006-12-08', '380950123188', 'romavoloshyn@gmail.com'),
('Олександр', 'Ковальчук', '1995-03-15', '380671234567', 'o.kovalchuk@gmail.com'),
('Марія', 'Бондар', '2001-07-22', '380509876543', 'mariya.bondar@gmail.com'),
('Андрій', 'Ткаченко', '1988-11-30', '380631112233', 'tkachenko.andriy@gmail.com'),
('Олена', 'Левченко', '2004-05-12', '380974445566', 'levchenko.olena@gmail.com'),
('Дмитро', 'Павленко', '1992-01-25', '380997778899', 'pavlenko.dm@gmail.com'),
('Юлія', 'Шевченко', '1998-09-08', '380936667788', 'shevchenko.yulia@gmail.com'),
('Ігор', 'Мельник', '2005-12-20', '380682223344', 'imelnyk@gmail.com');

INSERT INTO patient (gender, type_client, people_id) VALUES
('чоловік', 'пацієнт', 1),
('чоловік', 'VIP', 2),
('чоловік', 'корпоративний клієнт', 3),
('чоловік', 'пацієнт', 4),
('жінка', 'VIP', 5),
('чоловік', 'пацієнт', 6),
('жінка', 'корпоративний клієнт', 7),
('чоловік', 'страховий пацієнт', 8),
('жінка', 'страховий пацієнт', 9),
('чоловік', 'пацієнт', 10);

-- Додаємо лікарів
INSERT INTO doctor (staff_type, people_id) VALUES
('направник', 1), 
('спеціаліст', 4), 
('асистент', 8), 
('спеціаліст', 9);

INSERT INTO doctor_specialty (doctor_id, specialty_id) VALUES
(1, 1), 
(2, 4),
(3, 8), 
(4, 9); 

INSERT INTO service (category_id, title, price, duration) VALUES
(1, 'Консультація гастроентеролога', 950.00, '60 minutes'),
(2, 'Алергологічна проба', 180.00, '30 minutes'),
(3, 'Вакцинація Shingrix', 35960.00, '15 minutes'),
(4, 'Фонофорез', 590.00, '60 minutes'),
(5, 'Антицелюлітний масаж', 1200.00, '60 minutes'),
(6, 'Ректороманоскопія', 950.00, '60 minutes'),
(7, 'Повторна консультація ревматолога', 1400.00, '30 minutes'),
(8, 'Компрес молочної залози', 610.00, '30 minutes'),
(9, 'Діагностика лампою ВУДА', 390.00, '20 minutes'),
(10, 'Кардіологічний чек-ап', 7395.00, '60 minutes');


INSERT INTO appointment (date_time, patient_id, doctor_id) VALUES
('2024-05-16 10:00:00', 3, 4), 
('2024-05-16 11:30:00', 9, 1),
('2024-05-16 14:00:00', 10, 2),
('2024-05-17 09:00:00', 6, 1);

INSERT INTO appointment_details (appointment_id, service_id) VALUES
(1, 9),
(2, 6), 
(3, 4), 
(4, 3); 
